#include <iostream>


void main()
{
	setlocale(LC_ALL, "Russian");

	std::cout << "Мишка косолапый" << std::endl
			  << "По лесу идёт," << std::endl
			  << "Шишки собирает," << std::endl
			  << "Песенки поёт." << std::endl

			  << "Вдруг, упала шишка." << std::endl
			  << "Прямо мишке в лоб..." << std::endl
			  << "Оступился  мишка" << std::endl
			  << "И об землю - хлоп!" << std::endl

			  << "Засвистел на ветке" << std::endl
			  << "Пересмешник дрозд:" << std::endl
			  << "- Мишка косолапый" << std::endl
			  << "Наступил на хвост!" << std::endl

			  << "А за ним вдогонку" << std::endl
			  << "Пятеро зайчат" << std::endl
			  << "- Мишка косолапый! -" << std::endl
			  << "Из кустов кричат." << std::endl

			  << "Подхватил дразнилку" << std::endl
			  << "Весь лесной народ" << std::endl
			  << "- Мишка косолапый" << std::endl
			  << "По лесу идёт!.." << std::endl

			  << "Бросился к берлоге" << std::endl
			  << "Маленький медведь:" << std::endl
			  << "- Чем такие ноги -" << std::endl
			  << "Лучше умереть!" << std::endl

			  << "Спрятался за шкапом" << std::endl
			  << "И ревёт ревмя:" << std::endl
			  << "- Мишкой косолапым" << std::endl
			  << "Дразнят все меня!" << std::endl

			  << "Мама удивилась:" << std::endl
			  << "- Глупенький сынок," << std::endl
			  << "Я всегдаа гордилась" << std::endl
			  << "Формой твоих ног." << std::endl
			  << "Я ведь косолапа," << std::endl
			  << "И папа косолап," << std::endl
			  << "Косолапил славно" << std::endl
			  << "И дедушка Потап!" << std::endl

			  << "Мишка косолапый" << std::endl
			  << "Стал ужасно горд." << std::endl
			  << "Вымыл с мылом лапы," << std::endl
			  << "Сьел медовый торт." << std::endl

			  << "Вышел из берлоги," << std::endl
			  << "И как заорёт:" << std::endl
			  << "- Мишка косолапый" << std::endl
			  << "По лесу идёт!";
}