#include <iostream>

using namespace std;

void main()
{
	setlocale(LC_ALL, "Rus");
	cout << "Мишка косолапый\nПо лесу идёт,\nШишки собирает,\nПесенки поёт.\n\nВдруг упала шишка.\nПрямо Мишке в лоб...\nОступился Мишка\nИ об землю - хлоп!\n\nЗасвистел на ветке\nПересмешник - дрозд:\n-Мишка косолапый\nНаступил на хвост!\n\nА за ним вдогонку\nПятеро зайчат :\n-Мишка косолапый!-\nИз кустов кричат.\n\nПодхватил дразнилку\nВесь лесной народ :\n-Мишка косолапый\nПо лесу идет!..\n\nБросился к берлоге\nМаленький медведь :\n-Чем такие ноги -\nЛучше умереть!\n\nСпрятался за шкапом\nИ ревёт ревмя :\n-Мишкой косолапым\nДразнят все меня!\n\nМама удивилась:\n-Глупенький сынок,\nЯ всегда гордилась\n Формой твоих ног.\nЯ ведь косолапа,\nИ папа косолап,\nКосолапил славно\nИ дедушка Потап!\n\nМишка косолапый\nСтал ужасно горд.\nВымыл с мылом лапы,\nСъел медовый торт.\n\nВышел из берлоги\nИ как заорёт:\n-МИШКА КОСОЛАПЫЙ\nПО ЛЕСУ ИДЁТ!\n";
}